# Pandas

### Import Pandas Library

In [1]:
import pandas as pd

<br>

### Series

In [2]:
raw_data = ['Abil', 'Alya', 'Asep', 'Caca', 'Jonathan', 'Vira']

In [3]:
# convert list to series
data = pd.Series(raw_data)

#display data
print(data)

0        Abil
1        Alya
2        Asep
3        Caca
4    Jonathan
5        Vira
dtype: object

In [4]:
# return view object 
print("What the values that contain in data variable => ", data.values)

What the values that contain in data variable =>  ['Abil' 'Alya' 'Asep' 'Caca' 'Jonathan' 'Vira']

In [5]:
data[2]

'Asep'

In [6]:
data[3]

'Caca'

In [7]:
data[1:5]

1        Alya
2        Asep
3        Caca
4    Jonathan
dtype: object

<br>

### Implicit Indexing
implicit index is the default index of python which starts from 0 and inclusive.

In [8]:
for i in range(len(data)):
    print("What the value in index -", i, ": ", data[i])

What the value in index - 0 :  Abil
What the value in index - 1 :  Alya
What the value in index - 2 :  Asep
What the value in index - 3 :  Caca
What the value in index - 4 :  Jonathan
What the value in index - 5 :  Vira

In [9]:
data[4]

'Jonathan'

In [10]:
data[1]

'Alya'

In [11]:
data[0]

'Abil'

<br>

### Explicit Indexing
Explicit index is the customize index name by user. Not always start from 0 and not inclusive.

In [12]:
raw_data = ['Abil', 'Alya', 'Asep', 'Caca', 'Jonathan', 'Vira']
index_data = ['member-1', 'member-2', 'member-3', 'member-4', 'member-5', 'member-6']

data = pd.Series(raw_data, index_data)

print(data)

member-1        Abil
member-2        Alya
member-3        Asep
member-4        Caca
member-5    Jonathan
member-6        Vira
dtype: object

In [13]:
data['member-1':'member-5']

member-1        Abil
member-2        Alya
member-3        Asep
member-4        Caca
member-5    Jonathan
dtype: object

In [14]:
data['member-4']

'Caca'

In [15]:
data['member-1']

'Abil'

In [16]:
data['member-0']

KeyError: 'member-0'

<b>This syntax error because member-0 doesn't exist</b>

<br>

### loc
The loc function to access data by explicit index.

In [17]:
data.loc['member-2']

'Alya'

In [18]:
data.loc['member-1':'member-6']

member-1        Abil
member-2        Alya
member-3        Asep
member-4        Caca
member-5    Jonathan
member-6        Vira
dtype: object

In [19]:
data.loc['member-1':'member-6':2]

member-1        Abil
member-3        Asep
member-5    Jonathan
dtype: object

<br>

### iloc
The iloc funtion to access data by implicit index

In [20]:
data.iloc[2]

'Asep'

In [21]:
data.iloc[1:6]

member-2        Alya
member-3        Asep
member-4        Caca
member-5    Jonathan
member-6        Vira
dtype: object

In [22]:
data.iloc[1:6:2]

member-2    Alya
member-4    Caca
member-6    Vira
dtype: object

<br>

### DataFrame
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [23]:
address = {'Abil':'Bandung',
           'Alya':'Bogor',
           'Asep':'Cimahi',
           'Caca': 'Bandung',
           'Jonathan': 'Jambi',
           'Vira': 'Malang'}

In [24]:
hobby = {'Abil':'Futsal',
         'Alya':'Nonton',
         'Asep':'Cari cuan',
         'Caca': 'Membaca',
         'Jonathan': 'Gaming',
         'Vira': 'Dengerin podcast'}

In [25]:
dream_career = {'Abil':'DS',
                'Alya':'DS',
                'Asep':'Backend',
                'Caca': 'IRT',
                'Jonathan': 'DS',
                'Vira': 'DA'}

In [26]:
kelompok_5 = pd.DataFrame({'Address':address, 'Hobby':hobby, 'Career':dream_career})

kelompok_5

          Address             Hobby   Career
Abil      Bandung            Futsal       DS
Alya        Bogor            Nonton       DS
Asep       Cimahi         Cari cuan  Backend
Caca      Bandung           Membaca      IRT
Jonathan    Jambi            Gaming       DS
Vira       Malang  Dengerin podcast       DA

In [27]:
print("Display value that contains in address variable :\n---------------------------")
kelompok_5['Address']

Display value that contains in address variable :
---------------------------

Abil        Bandung
Alya          Bogor
Asep         Cimahi
Caca        Bandung
Jonathan      Jambi
Vira         Malang
Name: Address, dtype: object

In [28]:
print("Display value that contains in hobby variable :\n---------------------------")
kelompok_5['Hobby']

Display value that contains in hobby variable :
---------------------------

Abil                  Futsal
Alya                  Nonton
Asep               Cari cuan
Caca                 Membaca
Jonathan              Gaming
Vira        Dengerin podcast
Name: Hobby, dtype: object

In [29]:
print("Display value that contains in dream career variable :\n---------------------------")
kelompok_5['Career']

Display value that contains in dream career variable :
---------------------------

Abil             DS
Alya             DS
Asep        Backend
Caca            IRT
Jonathan         DS
Vira             DA
Name: Career, dtype: object

<br>

### DataFrame - head()
The head() function is used to get the first n rows. By default n returns the first 5 rows of the dataset

In [30]:
kelompok_5 = pd.read_csv('kelompok_5.csv')

kelompok_5.head()

       Nama Domisili       Hobi   Career  Hewan Peliharaan  Usia
0      Abil  Bandung     Futsal       DS               2.0    21
1      Alya    Bogor     Nonton       DS               3.0    21
2      Asep   Cimahi  Cari cuan  Backend               NaN    21
3      Caca  Bandung    Membaca      IRT               1.0    21
4  Jonathan    Jambi     Gaming       DS               1.0    24

<br>

### DataFrame - tail()
The tail() function is used to get the last n rows. By default n return the last 5 rows of the dataset

In [31]:
kelompok_5.tail()

       Nama Domisili              Hobi   Career  Hewan Peliharaan  Usia
1      Alya    Bogor            Nonton       DS               3.0    21
2      Asep   Cimahi         Cari cuan  Backend               NaN    21
3      Caca  Bandung           Membaca      IRT               1.0    21
4  Jonathan    Jambi            Gaming       DS               1.0    24
5      Vira   Malang  Dengerin Podcast       DA               1.0    22

<br>

### DataFrame - shape
The shape() function to return a tuple representing the dimensionality of the DataFrame

In [32]:
print("How many rows and columns in \'kelompok_5\' dataset : ", kelompok_5.shape)

How many rows and columns in 'kelompok_5' dataset :  (6, 6)

<br>

### DataFrame - columns
The columns function to return column labels in dataset

In [33]:
print("Show the columns in kelompok_5\' dataset : \n", kelompok_5.columns)

Show the columns in kelompok_5' dataset :
 Index(['Nama', 'Domisili', 'Hobi', 'Career', 'Hewan Peliharaan', 'Usia'], dtype='object')

<br>

### DataFrame - index
The index function returns the index information of the DataFrame.

In [34]:
kelompok_5.index

RangeIndex(start=0, stop=6, step=1)

<br>

### DataFrame - info()
The info() function return information about the DataFrame.

The information contains the number of columns, column labels, column data types, memory usage, range index, and the number of cells in each column (non-null values).

In [35]:
kelompok_5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Nama              6 non-null      object
 1   Domisili          6 non-null      object
 2   Hobi              6 non-null      object
 3   Career            6 non-null      object
 4   Hewan Peliharaan  5 non-null      float64
 5   Usia              6 non-null      int64
dtypes: float64(1), int64(1), object(4)
memory usage: 416.0+ bytes

<br>

### DataFrame - describe()
The describe() function returns description of the data in the DataFrame.

If the DataFrame contains numerical data, the description contains these information for each column: <br>
<li>count - The number of not-empty values. </li>
<li>mean - The average (mean) value. </li>
<li>std - The standard deviation. </li>
<li>min - the minimum value. </li>
<li>25% - The 25% percentile*. </li>
<li>50% - The 50% percentile*. </li>
<li>75% - The 75% percentile*. </li>
<li>max - the maximum value.

In [36]:
kelompok_5.describe()

       Hewan Peliharaan       Usia
count          5.000000   6.000000
mean           1.600000  21.666667
std            0.894427   1.211060
min            1.000000  21.000000
25%            1.000000  21.000000
50%            1.000000  21.000000
75%            2.000000  21.750000
max            3.000000  24.000000

<br>

### DataFrame - pop()

In [37]:
kelompok_5.pop

<bound method DataFrame.pop of        Nama Domisili              Hobi   Career  Hewan Peliharaan  Usia
0      Abil  Bandung            Futsal       DS               2.0    21
1      Alya    Bogor            Nonton       DS               3.0    21
2      Asep   Cimahi         Cari cuan  Backend               NaN    21
3      Caca  Bandung           Membaca      IRT               1.0    21
4  Jonathan    Jambi            Gaming       DS               1.0    24
5      Vira   Malang  Dengerin Podcast       DA               1.0    22>

<br>

### DataFrame - isnull()
The isnull().sum() to count missing values in each row and column

In [38]:
kelompok_5.isnull().sum()

Nama                0
Domisili            0
Hobi                0
Career              0
Hewan Peliharaan    1
Usia                0
dtype: int64

In [39]:
kelompok_5[kelompok_5['Hewan Peliharaan'].isnull()]

   Nama Domisili       Hobi   Career  Hewan Peliharaan  Usia
2  Asep   Cimahi  Cari cuan  Backend               NaN    21

<br>

### DataFrame - notnull().sum()
The notnull().sum() function to count values not null in each row and column

In [40]:
kelompok_5.notnull().sum()

Nama                6
Domisili            6
Hobi                6
Career              6
Hewan Peliharaan    5
Usia                6
dtype: int64

In [41]:
kelompok_5[kelompok_5['Hewan Peliharaan'].notnull()]

       Nama Domisili              Hobi Career  Hewan Peliharaan  Usia
0      Abil  Bandung            Futsal     DS               2.0    21
1      Alya    Bogor            Nonton     DS               3.0    21
3      Caca  Bandung           Membaca    IRT               1.0    21
4  Jonathan    Jambi            Gaming     DS               1.0    24
5      Vira   Malang  Dengerin Podcast     DA               1.0    22

<br>

### DataFrame - mean()
The mean() function used to calculate mean/average of a given list of numbers

In [42]:
kelompok_5['Hewan Peliharaan'].mean()

1.6

In [43]:
kelompok_5['Usia'].mean()

21.666666666666668

<br>

### DataFrame - max()
The max() function returns a data with the maximum value of each column

In [44]:
kelompok_5['Hewan Peliharaan'].max()

3.0

In [45]:
kelompok_5['Usia'].max()

24

<br>

### DataFrame - unique()
The unique() function is used to get unique values in dataset

In [46]:
kelompok_5['Domisili'].unique()

array(['Bandung', 'Bogor', 'Cimahi', 'Jambi', 'Malang'], dtype=object)

In [47]:
kelompok_5['Usia'].unique()

array([21, 24, 22], dtype=int64)

In [48]:
kelompok_5['Career'].unique()

array(['DS', 'Backend', 'IRT', 'DA'], dtype=object)